Revit 2023 API
FabricationPartRouteEnd.CreateFromConnector Method
 Create fabrication routing end from connector end point.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2017
Syntax
C#
public static FabricationPartRouteEnd CreateFromConnector(
	Connector connnector
)
Visual Basic
Public Shared Function CreateFromConnector ( _
	connnector As Connector _
) As FabricationPartRouteEnd
Visual C++
public:
static FabricationPartRouteEnd^ CreateFromConnector(
	Connector^ connnector
)
Parameters
connnector
Type: Autodesk.Revit.DB.Connector
 The connector that the route will connect to. Must not already be connected.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Connector is connected.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace